Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.UnableToUpgradeAnalyticalElementGeometry Property
 Unable to upgrade analytical element with incorrect geometry. To keep the elements, open Revit 2022 and correct the elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToUpgradeAnalyticalElementGeometry { get; }
Visual Basic
Public Shared ReadOnly Property UnableToUpgradeAnalyticalElementGeometry As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToUpgradeAnalyticalElementGeometry {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace